app/controllers/passes_controller.rb

def index
  @user = User.last
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT 1