app/controllers/users_controller.rb

INSERT INTO "users" ("address", "created_at", "email", "name", "phone_number", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["address", nil], ["created_at", Mon, 13 Jan 2014 16:10:51 UTC +00:00], ["email", nil], ["name", nil], ["phone_number", nil], ["updated_at", Mon, 13 Jan 2014 16:10:51 UTC +00:00]]
---
  def index
    user_input_address = params[:user_input_address]
    user = User.new
    user.address = user_input_address
    user.save!